Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актуальная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтображатьВОтчетахПисьмахКакПодарок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комплектующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Номенклатура/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура АктуализироватьКомплекты(Команда)
	
	АктуализироватьКомплектыНаСервере();
	Сообщить("Актуализация завершена");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура АктуализироватьКомплектыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураКомплектующие.Ссылка,
	|	МАКСИМУМ(НоменклатураКомплектующие.Номенклатура.Актуальная) КАК НоменклатураАктуальная,
	|	НоменклатураКомплектующие.Ссылка.Актуальная
	|ИЗ
	|	Справочник.Номенклатура.Комплектующие КАК НоменклатураКомплектующие
	|
	|СГРУППИРОВАТЬ ПО
	|	НоменклатураКомплектующие.Ссылка,
	|	НоменклатураКомплектующие.Ссылка.Актуальная
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(НоменклатураКомплектующие.Номенклатура.Актуальная) <> НоменклатураКомплектующие.Ссылка.Актуальная";
	
	Запрос.УстановитьПараметр("", );
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СпрОбъект 				= Выборка.Ссылка.ПолучитьОбъект();
			СпрОбъект.Актуальная 	= Выборка.НоменклатураАктуальная;
			
			Попытка
				СпрОбъект.Записать();
				Сообщить("Успешно актуализирован комплект: """ + Выборка.Ссылка + """");
			Исключение
				Сообщить("Не удалось актуализировать комплект: """ + Выборка.Ссылка + """");
			    Сообщить(ОписаниеОшибки(), СтатусСообщения.Внимание);
			КонецПопытки;
			
		КонецЦикла;  
		
	КонецЕсли; 
	
КонецПроцедуры
